SDK/aax/ExamplePlugIns/Documentation/Doxygen/dot/aax_ieffectparams_related.dot
//        Copyright 2016, 2021, 2023-2024 Avid Technology, Inc.
//        All rights reserved.
// 
// This file is part of the Avid AAX SDK.
// 
// The AAX SDK is subject to commercial or open-source licensing.
// 
// By using the AAX SDK, you agree to the terms of both the Avid AAX SDK License
// Agreement and Avid Privacy Policy.
// 
// AAX SDK License: https://developer.avid.com/aax
// Privacy Policy: https://www.avid.com/legal/privacy-policy-statement
// 
// Or: You may also use this code under the terms of the GPL v3 (see
// www.gnu.org/licenses).
// 
// THE AAX SDK IS PROVIDED "AS IS" WITHOUT ANY WARRANTY, AND ALL WARRANTIES, WHETHER
// EXPRESSED OR IMPLIED, INCLUDING MERCHANTABILITY AND FITNESS FOR PURPOSE, ARE
// DISCLAIMED.

digraph aax_ieffectparams_related {
	graph [ fontname=Helvetica ];
	rankdir=BT;
	node [shape=record, fontname=Helvetica, fontsize=10];

	iacfdata [ label="AAX_IACFEffectParameters" URL="\ref AAX_IACFEffectParameters"];
	idata [ label="AAX_IEffectParameters" URL="\ref AAX_IEffectParameters"];
	cdata [ label="AAX_CEffectParameters" URL="\ref AAX_CEffectParameters"];
	cgui [ label="AAX_CEffectGUI" URL="\ref AAX_CEffectGUI"];
	iplugin [ label="AAX_IController" URL="\ref AAX_IController"];
	iauto [ label="AAX_IAutomationDelegate" URL="\ref AAX_IAutomationDelegate"];

	// Using cparam here as a proxy for cdata...
	cdata -> idata;
	cdata -> iplugin [ arrowhead="open", style="dashed" ];
	cdata -> iauto [ arrowhead="open", style="dashed" ];

	idata -> iacfdata;
	cgui -> idata [ arrowhead="open", style="dashed" ];
}
